Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_2 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 67)                52595     
_________________________________________________________________
dense_8 (Dense)              (None, 10)                680       
=================================================================
Total params: 53,275
Trainable params: 53,275
Non-trainable params: 0
_________________________________________________________________