Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 125)               98125     
_________________________________________________________________
dense_4 (Dense)              (None, 87)                10962     
_________________________________________________________________
dense_5 (Dense)              (None, 89)                7832      
_________________________________________________________________
dense_6 (Dense)              (None, 10)                900       
=================================================================
Total params: 117,819
Trainable params: 117,819
Non-trainable params: 0
_________________________________________________________________