Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_3 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 226)               177410    
_________________________________________________________________
dense_10 (Dense)             (None, 48)                10896     
_________________________________________________________________
dense_11 (Dense)             (None, 10)                490       
=================================================================
Total params: 188,796
Trainable params: 188,796
Non-trainable params: 0
_________________________________________________________________