Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
dense (Dense)                (None, 123)               96555     
_________________________________________________________________
dense_1 (Dense)              (None, 112)               13888     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                1130      
=================================================================
Total params: 111,573
Trainable params: 111,573
Non-trainable params: 0
_________________________________________________________________