Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_4 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 38)                29830     
_________________________________________________________________
dense_13 (Dense)             (None, 72)                2808      
_________________________________________________________________
dense_14 (Dense)             (None, 10)                730       
=================================================================
Total params: 33,368
Trainable params: 33,368
Non-trainable params: 0
_________________________________________________________________