Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_5 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 60)                47100     
_________________________________________________________________
dense_16 (Dense)             (None, 66)                4026      
_________________________________________________________________
dense_17 (Dense)             (None, 10)                670       
=================================================================
Total params: 51,796
Trainable params: 51,796
Non-trainable params: 0
_________________________________________________________________